# '''
#
# 将华氏温度转换为摄氏温度
# 转换公式为C = (F-32)/18
#
# '''
#
# f = float(input('请输入华氏温度: '))
#
# c = (f - 32) / 1.8
#
# # .1f 表示这是一个浮点数，小数点后保留1位有效数字
# print('%.1f华氏度 = %.1f摄氏度' % (f, c))
#
# # # 字符串前加f 表示格式化进行输出
# # print(f'{f:.1f}华氏度 = {c:.1f}摄氏度')


# '''
# 输入圆的半径计算周长和面积
#
# '''
# # 定义圆周率pi等于3.14
# pi = 3.14
#
# r = int(input("请输入圆的半径:"))
#
# # 计算周长
# c = 2*pi*r
#
# # 计算面积
# s = pi*r**2
#
# print("圆的周长为:",c)
# print("圆的面积为:",s)


# '''
# 输入年份判断是否为闰年
# 判断是否为闰年需要满足，能够被4整除，
# 不能被100整除,或者能被400整除
#
# '''
#
# year = int(input("请输入年份:"))
#
# if (year // 4 and (year//400 or year//100 != 0)):
#     print('是闰年')
# else:
#     print("不是闰年")
